In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
# 1. How to import pandas and check the version?
print(pd.__version__)
# print(pd.show_versions())

1.3.5

In [4]:
# 2. How to create a series from a list, numpy array and dict?
# Create a pandas series from each of the items below: a list, numpy and a dictionary
mylist = list('abcedfghijklmnopqstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
alphabets_list = pd.Series(mylist)
arr_df = pd.Series(myarr)
dict_df = pd.Series(mydict)

In [5]:
# 3. How to convert the index of a series into a column of a dataframe?
# Difficulty Level: L1

# Convert the series ser into a dataframe with its index as another column on the dataframe.

# Input

mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
# Solution 1
df = pd.DataFrame(ser.index, columns=['alphabets'])
# Solution 2
ser.to_frame().reset_index().loc[:, ['index']][:6]

  index
0     a
1     b
2     c
3     e
4     d
5     f

In [6]:
# 4. How to combine many series to form a dataframe?
# Difficulty Level: L1

# Combine ser1 and ser2 to form a dataframe.

# Input
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# Solution 1
df = pd.DataFrame(data={
    "alphabets": ser1,
    "integers": ser2
})

# Solution 2
pd.concat([ser1, ser2], axis=1).head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [7]:
# 5. How to assign name to the series’ index?
# Difficulty Level: L1

# Give a name to the series ser calling it ‘alphabets’.

# Input

ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser.name = 'alphabets'
ser[:5]

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

In [8]:
# 6. How to get the items of series A not present in series B?
# Difficulty Level: L2

# From ser1 remove items present in ser2.

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser1[~(ser1.isin(ser2))]

0    1
1    2
2    3
dtype: int64

In [9]:
# 7. How to get the items not common to both series A and series B?
# Difficulty Level: L2
# Get all items of ser1 and ser2 not common to both.

# Input

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# Solution 1
unique_ser1 = ser1[~(ser1.isin(ser2))]
unique_ser2 = ser2[~(ser2.isin(ser1))]
print(pd.concat([unique_ser1, unique_ser2]))

# Solution 2
ser_u = pd.Series(np.union1d(ser1, ser2))  # union
ser_i = pd.Series(np.intersect1d(ser1, ser2))  # intersect
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [10]:
# 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
# Difficuty Level: L2

# Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

# Input
np.random.seed(123)
ser = pd.Series(np.random.normal(10, 5, 25))
# Solution 1
print(f'min: {round(ser.min(), 2)}')
print(f'max: {round(ser.max(), 2)}')
print(f'25th_percentile: {np.percentile(ser, 25)}')
print(f'75th_percentile: {np.percentile(ser, 75)}')
# Solution 2
np.percentile(ser, q=[0, 25, 50, 75, 100])

min: -2.13
max: 21.03
25th_percentile: 6.605569241889729
75th_percentile: 15.879145223910516

array([-2.13339622,  6.60556924,  9.52645516, 15.87914522, 21.02965041])

In [16]:
# 9. How to get frequency counts of unique items of a series?
# Difficulty Level: L1

# Calculte the frequency counts of each unique value ser.

# Input

ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

d    8
g    8
b    5
f    2
h    2
c    2
e    2
a    1
dtype: int64

In [17]:
# 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
# Difficulty Level: L2

# From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

# Input

np.random.seed(123)
ser = pd.Series(np.random.randint(1, 5, [12]))
print(ser)
print(ser.value_counts().nlargest(2))
ser[~(ser.isin(ser.value_counts().nlargest(2).index))] = 'other'
ser

0     3
1     2
2     3
3     3
4     1
5     3
6     3
7     2
8     4
9     3
10    4
11    2
dtype: int32
3    6
2    3
dtype: int64

0         3
1         2
2         3
3         3
4     other
5         3
6         3
7         2
8     other
9         3
10    other
11        2
dtype: object

In [18]:
# 1. How to bin a numeric series to 10 groups of equal size?
# Difficulty Level: L2

# Bin the series ser into 10 equal deciles and replace the values with the bin name.

# Input
np.random.seed(123)
ser = pd.Series(np.random.random(20))

# Desired Output

# # First 5 items
# 0    7th
# 1    9th
# 2    7th
# 3    3rd
# 4    8th
# dtype: category
# Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]
print(
    pd.qcut(ser,
           q=np.arange(0, 1.1, 0.1),
           labels=[
               '1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th',
               '10th'
           ])[:5])

0    8th
1    3rd
2    2nd
3    7th
4    9th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

In [19]:
# 12. How to convert a numpy array to a dataframe of given shape? (L1)
# Difficulty Level: L1

# Reshape the series ser into a dataframe with 7 rows and 5 columns

# Input

# Solution 1
ser = pd.Series(np.random.randint(1, 10, 35))
print(pd.DataFrame(np.array(ser).reshape((7, 5))).head())
print('=====================')
# Solution 2
df = pd.DataFrame(ser.values.reshape(7,5))
print(df.head())

   0  1  2  3  4
0  9  1  8  4  5
1  7  2  6  7  3
2  2  9  4  6  1
3  3  7  3  5  5
4  7  4  1  7  5
=====================
   0  1  2  3  4
0  9  1  8  4  5
1  7  2  6  7  3
2  2  9  4  6  1
3  3  7  3  5  5
4  7  4  1  7  5

In [20]:
# 13. How to find the positions of numbers that are multiples of 3 from a series?
# Difficulty Level: L2

# Find the positions of numbers that are multiples of 3 from ser.

# Input
np.random.seed(123)
ser = pd.Series(np.random.randint(1, 10, 7))
print(ser)
print('===============')
# Solution 1
print(ser[ser % 3 == 0].index)
# Solution 2
np.argwhere(np.array(ser) % 3 == 0)

0    3
1    3
2    7
3    2
4    4
5    7
6    2
dtype: int32
===============
Int64Index([0, 1], dtype='int64')

array([[0],
       [1]], dtype=int64)

In [21]:
# 14. How to extract items at given positions from a series
# Difficulty Level: L1

# From ser, extract the items at positions in list pos.

# Input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
# Solution 1
print(ser[pos])
# Solution 2
print(np.take(ser, pos))

0     a
4     e
8     i
14    o
20    u
dtype: object
0     a
4     e
8     i
14    o
20    u
dtype: object

In [22]:
# 15. How to stack two series vertically and horizontally ?
# Difficulty Level: L1

# Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

# Input

ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
print(pd.concat([ser1, ser2]))
print(pd.concat([ser1, ser2], axis=1))

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [23]:
# 16. How to get the positions of items of series A in another series B?
# Difficulty Level: L2

# Get the positions of items of ser2 in ser1 as a list.

# Input

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

# Solution
print(ser1[ser1.isin(ser2)].index)

# Solution 1
print([np.where(i == ser1)[0].tolist()[0] for i in ser2])

# Solution 2
print([pd.Index(ser1).get_loc(i) for i in ser2])

Int64Index([0, 4, 5, 8], dtype='int64')
[5, 4, 0, 8]
[5, 4, 0, 8]

In [24]:
# 7. How to compute the mean squared error on a truth and predicted series?
# Difficulty Level: L2

# Compute the mean squared error of truth and pred series.

# Input

truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

print(f'MSE: {sum((truth - pred) ** 2) / len(pred)}')

MSE: 0.24356147843104484

In [25]:
# 18. How to convert the first character of each element in a series to uppercase?
# Difficulty Level: L2

# Change the first character of each word to upper case in each word of ser.

ser = pd.Series(['how', 'to', 'kick', 'ass?'])
# Solution 1
print(ser.apply(lambda x: x.title()))
# Solution 2
print(ser.map(lambda x: x.title()))

0     How
1      To
2    Kick
3    Ass?
dtype: object
0     How
1      To
2    Kick
3    Ass?
dtype: object

In [26]:
# 19. How to calculate the number of characters in each word in a series?
# Difficulty Level: L2

# Input

ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.map(lambda x: {x: len(x)})

0     {'how': 3}
1      {'to': 2}
2    {'kick': 4}
3    {'ass?': 4}
dtype: object

In [27]:
# 20. How to compute difference of differences between consequtive numbers of a series?
# Difficulty Level: L1

# Difference of differences between the consequtive numbers of ser.

# Input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Desired Output

# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]
ser.diff().diff().values

array([nan, nan,  1.,  1.,  1.,  1.,  0.,  2.])

In [28]:
# 21. How to convert a series of date-strings to a timeseries?
# Difficiulty Level: L2

# Input

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
# Desired Output
# 0   2010-01-01 00:00:00
# 1   2011-02-02 00:00:00
# 2   2012-03-03 00:00:00
# 3   2013-04-04 00:00:00
# 4   2014-05-05 00:00:00
# 5   2015-06-06 12:20:00
# dtype: datetime64[ns]
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [36]:
# 22. How to get the day of month, week number, day of year and day of week from a series of date strings?
# Difficiulty Level: L2

# Get the day of month, week number, day of year and day of week from ser.

# Input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

# Desired output
# Date:  [1, 2, 3, 4, 5, 6]
# Week number:  [53, 5, 9, 14, 19, 23]
# Day num of year:  [1, 33, 63, 94, 125, 157]
# Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

ser = pd.to_datetime(ser)
print(f'Date: {ser.dt.day.values}')
print(f'Week number: {ser.dt.week.values}')
print(f'Day num of year: {ser.dt.dayofyear.values}')
print(f'Day of week: {ser.dt.day_name().values}')

Date: [1 2 3 4 5 6]
Week number: [53  5  9 14 19 23]
Day num of year: [  1  33  63  94 125 157]
Day of week: ['Friday' 'Wednesday' 'Saturday' 'Thursday' 'Monday' 'Saturday']

c:\users\muhammad ali\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:17: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  app.launch_new_instance()

In [41]:
# 23. How to convert year-month string to dates corresponding to the 4th day of the month?
# Difficiulty Level: L2

# Change ser to dates that start with 4th of the respective months.

# Input
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

# Desired Output

# 0   2010-01-04
# 1   2011-02-04
# 2   2012-03-04
# dtype: datetime64[ns]

ser = pd.to_datetime(ser)
ser + pd.Timedelta(3, 'days')

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

In [50]:
# 24. How to filter words that contain atleast 2 vowels from a series?
# Difficiulty Level: L3

# From ser, extract words that contain atleast 2 vowels.

# Input

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

# Desired Output

# 0     Apple
# 1    Orange
# 4     Money
# dtype: object

def check_vowels(x):
    return sum([1 for i in x.lower() if i in 'aeious']) >= 2
ser[ser.apply(check_vowels)]

0     Apple
1    Orange
4     Money
dtype: object

In [70]:
# 25. How to filter valid emails from a series?
# Difficiulty Level: L3

# Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

# Input

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

# Desired Output
# 1    rameses@egypt.com
# 2            matt@t.co
# 3    narendra@modi.com
# dtype: object
emails[emails.apply(lambda x: len(re.findall(pattern, x)) > 0)]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

In [76]:
# 26. How to get the mean of a series grouped by another series?
# Difficiulty Level: L2

# Compute the mean of weights of each fruit.

# Input
np.random.seed(123)
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())
#> [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
#> ['banana', 'carrot', 'apple', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'apple', 'carrot']
df = pd.DataFrame(data={'fruit': fruit, 'weights': weights})
df.groupby('fruit').mean('weights').round(2)
# values can change due to randomness
# apple     6.0
# banana    4.0
# carrot    5.8
# dtype: float64

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['carrot', 'banana', 'carrot', 'carrot', 'apple', 'carrot', 'carrot', 'banana', 'carrot', 'banana']

        weights
fruit
apple      5.00
banana     6.67
carrot     5.00

In [83]:
# 27. How to compute the euclidean distance between two series?
# Difficiulty Level: L2

# Compute the euclidean distance between series (points) p and q, without using a packaged formula.

# Input

p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
n
# Desired Output

# 18.165

round(sum((q - p) ** 2) ** 0.5, 3)

18.166

In [21]:
# 28. How to find all the local maxima (or peaks) in a numeric series?
# Difficiulty Level: L3
    
# Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

# Input

ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

# 2 10 3
# 10 3 4
# 3 4 9
# 4 9 10
# 9 10 2
# 10 2 7
# 2 7 3

# Desired output
# array([1, 5, 7])

# Solution 1
checking_ser = pd.Series([x[1] for x in [list(ser[i:i+3]) for i in range(0, 9) if len(ser[i:i+3]) == 3] if x[1] > x[0] and x[1] > x[2]])
print(ser[ser.isin(checking_ser)].index)

# Solution 2
np.where(np.diff(np.sign(np.diff(ser))) == -2)[0] + 1

Int64Index([1, 5, 7], dtype='int64')

array([1, 5, 7], dtype=int64)

In [43]:
# 29. How to replace missing spaces in a string with the least frequent character?
# Replace the spaces in my_str with the least frequent character.

# Difficiulty Level: L2

# Input

my_str = 'dbc deb abed gade'
# Desired Output
# 'dbccdebcabedcgade' least frequent is 'c'

# Solution 1
print(my_str.replace(' ', pd.Series(list(my_str)).value_counts().idxmin()))

# Solution 2
my_str_ser = pd.Series(list(my_str))
print(''.join(my_str_ser.replace(' ', my_str_ser.value_counts().dropna().index[-1])))

dbccdebcabedcgade
dbcgdebgabedggade

In [56]:
# 30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?
# Difficiulty Level: L2

# Desired output

# values can be random
# 2000-01-01    4
# 2000-01-08    1
# 2000-01-15    8
# 2000-01-22    4
# 2000-01-29    4
# 2000-02-05    2
# 2000-02-12    4
# 2000-02-19    9
# 2000-02-26    6
# 2000-03-04    6

ser = pd.Series(np.random.randint(1, 10, 10),
                pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    3
2000-01-08    9
2000-01-15    5
2000-01-22    1
2000-01-29    7
2000-02-05    6
2000-02-12    4
2000-02-19    7
2000-02-26    1
2000-03-04    2
Freq: W-SAT, dtype: int32

In [171]:
# 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
# Difficiulty Level: L2

# ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

# Input

ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
#> 2000-01-01     1.0
#> 2000-01-03    10.0
#> 2000-01-06     3.0
#> 2000-01-08     NaN
#> dtype: float64

# Desired Output

# 2000-01-01     1.0
# 2000-01-02     1.0
# 2000-01-03    10.0
# 2000-01-04    10.0
# 2000-01-05    10.0
# 2000-01-06     3.0
# 2000-01-07     3.0
# 2000-01-08     NaN


# Solution 1
date_build = pd.date_range(ser.index.min(), ser.index.max())
ser2 = pd.Series(np.nan, date_build)
ser2[ser2.index.isin(ser.index)] = ser
print(ser2.ffill())

# Solution 2
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

In [29]:
# 32. How to compute the autocorrelations of a numeric series?
# Difficiulty Level: L3

# Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

# Input
np.random.seed(123)
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
autocorrelations = [ser.autocorr(i) for i in range(11)]
print(autocorrelations[1:])
print(f'Largest lag correlation: {np.argmax(autocorrelations[1:])}')
# Desired output

# values will change due to randomness
# [0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]
# Lag having highest correlation:  9

# MARK MARK

[0.3416378899570618, 0.14904031306624088, 0.48137029409303717, 0.48952745847716983, 0.07136257083837445, 0.28006857904147064, 0.4170047681972976, 0.09992528449233323, 0.21004739853861962, -0.010560973775730146]
Largest lag correlation: 3

In [35]:
# 33. How to import only every nth row from a csv file to create a dataframe?
# Difficiulty Level: L2

# Import every 50th row of BostonHousing dataset as a dataframe.
# Solution 1
# df = pd.read_csv('./boston_data.csv')
# df.loc[::50, :]

# Solution 2
df = pd.read_csv('./boston_data.csv', chunksize=50)
df2 = pd.DataFrame()
df2 = df2.append([chunk.iloc[0, :] for chunk in df])
print(df2)

         crim    zn  indus  chas    nox     rm    age     dis   rad    tax  \
0     0.00632  18.0   2.31   0.0  0.538  6.575   65.2  4.0900   1.0  296.0
50    0.08873  21.0   5.64   0.0  0.439  5.963   45.7  6.8147   4.0  243.0
100   0.14866   0.0   8.56   0.0  0.520  6.727   79.9  2.7778   5.0  384.0
150   1.65660   0.0  19.58   0.0  0.871  6.122   97.3  1.6180   5.0  403.0
200   0.01778  95.0   1.47   0.0  0.403  7.135   13.9  7.6534   3.0  402.0
250   0.14030  22.0   5.86   0.0  0.431  6.487   13.0  7.3967   7.0  330.0
300   0.04417  70.0   2.24   0.0  0.400  6.871   47.4  7.8278   5.0  358.0
350   0.06211  40.0   1.25   0.0  0.429  6.490   44.4  8.7921   1.0  335.0
400  25.04610   0.0  18.10   0.0  0.693  5.987  100.0  1.5888  24.0  666.0
450   6.71772   0.0  18.10   0.0  0.713  6.749   92.6  2.3236  24.0  666.0
500   0.22438   0.0   9.69   0.0  0.585  6.027   79.7  2.4982   6.0  391.0

     ptratio       b  lstat  medv
0       15.3  396.90   4.98  24.0
50      16.8  395.56  13.45  19.7
100     20.9  394.76   9.42  27.5
150     14.7  372.80  14.10  21.5
200     17.0  384.30   4.45  32.9
250     19.1  396.28   5.90  24.4
300     14.8  390.86   6.07  24.8
350     19.7  396.90   5.98  22.9
400     20.2  396.90  26.77   5.6
450     20.2    0.32  17.44  13.4
500     19.2  396.90  14.33  16.8

In [45]:
# 34. How to change column values when importing csv to a dataframe?
# Difficulty Level: L2

# Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.
df = pd.read_csv('./boston_data.csv')
# Soluton 1
df.loc[:, 'medv'] = df.loc[:, 'medv'].apply(lambda x: 'low' if x < 25 else 'high') 
# Solution 2
df = pd.read_csv('./boston_data.csv', converters={'medv': lambda x: 'Low' if float(x) < 25 else 'High'})
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High

In [48]:
# 35. How to import only specified columns from a csv file?
# Difficulty Level: L1

# Import ‘crim’ and ‘medv’ columns of the BostonHousing dataset as a dataframe.
df = pd.read_csv('./boston_data.csv', usecols=['crim', 'medv'])
df.columns

Index(['crim', 'medv'], dtype='object')

In [56]:
# 36. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and
# list equivalent.
# Difficulty Level: L2

# Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset. 
# Also get the numpy array and list equivalent of the dataframe.
df = pd.read_csv('./cars.csv')
print(f'Number of rows: {df.shape[0]}\n=================')
print(f'Number of columns: {df.shape[1]}\n=================')
print(f'Dtypes: \n{df.dtypes.value_counts()}\n=================')
print(f'Summary: \n{df.describe()}\n=================')
print(f'List equivalent: \n{df.values}')

Number of rows: 93
=================
Number of columns: 27
=================
Dtypes:
float64    18
object      9
dtype: int64
=================
Summary:
       Min.Price      Price  Max.Price   MPG.city  MPG.highway  EngineSize  \
count  86.000000  91.000000  88.000000  84.000000    91.000000   91.000000
mean   17.118605  19.616484  21.459091  22.404762    29.065934    2.658242
std     8.828290   9.724280  10.696563   5.841520     5.370293    1.045845
min     6.700000   7.400000   7.900000  15.000000    20.000000    1.000000
25%    10.825000  12.350000  14.575000  18.000000    26.000000    1.800000
50%    14.600000  17.700000  19.150000  21.000000    28.000000    2.300000
75%    20.250000  23.500000  24.825000  25.000000    31.000000    3.250000
max    45.400000  61.900000  80.000000  46.000000    50.000000    5.700000

       Horsepower          RPM  Rev.per.mile  Fuel.tank.capacity  Passengers  \
count   86.000000    90.000000     87.000000           85.000000   91.000000
mean   144.000000  5276.666667   2355.000000           16.683529    5.076923
std     53.455204   605.554811    486.916616            3.375748    1.045953
min     55.000000  3800.000000   1320.000000            9.200000    2.000000
25%    100.750000  4800.000000   2017.500000           14.500000    4.000000
50%    140.000000  5200.000000   2360.000000           16.500000    5.000000
75%    170.000000  5787.500000   2565.000000           19.000000    6.000000
max    300.000000  6500.000000   3755.000000           27.000000    8.000000

           Length   Wheelbase      Width  Turn.circle  Rear.seat.room  \
count   89.000000   92.000000  87.000000    88.000000       89.000000
mean   182.865169  103.956522  69.448276    38.954545       27.853933
std     14.792651    6.856317   3.778023     3.304157        3.018129
min    141.000000   90.000000  60.000000    32.000000       19.000000
25%    174.000000   98.000000  67.000000    36.000000       26.000000
50%    181.000000  103.000000  69.000000    39.000000       27.500000
75%    192.000000  110.000000  72.000000    42.000000       30.000000
max    219.000000  119.000000  78.000000    45.000000       36.000000

       Luggage.room       Weight
count     74.000000    86.000000
mean      13.986486  3104.593023
std        3.120824   600.129993
min        6.000000  1695.000000
25%       12.000000  2647.500000
50%       14.000000  3085.000000
75%       16.000000  3567.500000
max       22.000000  4105.000000
=================
List equivalent:
[['Acura' 'Integra' 'Small' ... 2705.0 'non-USA' 'Acura Integra']
 [nan 'Legend' 'Midsize' ... 3560.0 'non-USA' 'Acura Legend']
 ['Audi' '90' 'Compact' ... 3375.0 'non-USA' 'Audi 90']
 ...
 ['Volkswagen' 'Corrado' 'Sporty' ... 2810.0 'non-USA'
  'Volkswagen Corrado']
 ['Volvo' '240' 'Compact' ... 2985.0 'non-USA' 'Volvo 240']
 [nan '850' 'Midsize' ... 3245.0 'non-USA' 'Volvo 850']]

In [65]:
# 37. How to extract the row and column number of a particular cell with given criterion?
# Difficulty Level: L1

# Input

df = pd.read_csv('./cars.csv')
# Which manufacturer, model and type has the highest Price? What is the row and column number of the cell 
# with the highest Price value?

# Solution 1
print(df.groupby(['Manufacturer', 'Model', 'Type'])['Price'].sum().nlargest(1))

# Solution 2
df.loc[df.Price == df.Price.max(), ['Manufacturer', 'Model', 'Type']]

Manufacturer   Model  Type
Mercedes-Benz  300E   Midsize    61.9
Name: Price, dtype: float64

     Manufacturer Model     Type
58  Mercedes-Benz  300E  Midsize

In [75]:
# 38. How to rename a specific columns in a dataframe?
# Difficulty Level: L2

# Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.

# Input

df = pd.read_csv('./cars.csv')
df = df.rename(columns={'Type': 'CarType'})
df.columns = [i.replace('.', '_') for i in df.columns]
df.columns

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

In [88]:
# 39. How to check if a dataframe has any missing values?
# Difficulty Level: L1

# Check if df has any missing values.

# Input
df = pd.read_csv('./cars.csv')
df.isna().any()

Manufacturer          True
Model                 True
Type                  True
Min.Price             True
Price                 True
Max.Price             True
MPG.city              True
MPG.highway           True
AirBags               True
DriveTrain            True
Cylinders             True
EngineSize            True
Horsepower            True
RPM                   True
Rev.per.mile          True
Man.trans.avail       True
Fuel.tank.capacity    True
Passengers            True
Length                True
Wheelbase             True
Width                 True
Turn.circle           True
Rear.seat.room        True
Luggage.room          True
Weight                True
Origin                True
Make                  True
dtype: bool

In [105]:
# 40. How to count the number of missing values in each column?
# Difficulty Level: L2

# Count the number of missing values in each column of df. Which column has the maximum number of missing values?

# Input
df = pd.read_csv('./cars.csv')
df.isna().sum().idxmax()

'Luggage.room'

In [130]:
# 41. How to replace missing values of multiple numeric columns with the mean?
# Difficulty Level: L2

# Replace missing values in Min.Price and Max.Price columns with their respective mean.

# Input
df = pd.read_csv('./cars.csv')
df_numeric_cols = [
    col for col in df.columns if pd.api.types.is_numeric_dtype(df[col])
]
df.loc[:, df_numeric_cols] = df.loc[:, df_numeric_cols].apply(
    lambda x: x.fillna(x.mean().round(2)))
df.loc[:, df_numeric_cols]

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
0,12.90,15.9,18.80,25.0,31.0,1.80,140.0,6300.0,2890.0,13.2,5.0,177.0,102.0,68.00,37.0,26.5,13.99,2705.0
1,29.20,33.9,38.70,18.0,25.0,3.20,200.0,5500.0,2335.0,18.0,5.0,195.0,115.0,71.00,38.0,30.0,15.00,3560.0
2,25.90,29.1,32.30,20.0,26.0,2.80,172.0,5500.0,2280.0,16.9,5.0,180.0,102.0,67.00,37.0,28.0,14.00,3375.0
3,17.12,37.7,44.60,19.0,26.0,2.66,172.0,5500.0,2535.0,21.1,6.0,193.0,106.0,69.45,37.0,31.0,17.00,3405.0
4,17.12,30.0,21.46,22.0,30.0,3.50,208.0,5700.0,2545.0,21.1,4.0,186.0,109.0,69.00,39.0,27.0,13.00,3640.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,16.60,19.7,22.70,17.0,21.0,2.50,109.0,4500.0,2915.0,21.1,7.0,187.0,115.0,72.00,38.0,34.0,13.99,3960.0
89,17.60,20.0,22.40,21.0,30.0,2.00,134.0,5800.0,2685.0,18.5,5.0,180.0,103.0,67.00,35.0,31.5,14.00,2985.0
90,22.90,23.3,23.70,18.0,25.0,2.80,178.0,5800.0,2385.0,18.5,4.0,159.0,97.0,66.00,36.0,26.0,15.00,2810.0
91,21.80,22.7,23.50,21.0,28.0,2.30,114.0,5400.0,2215.0,15.8,5.0,190.0,104.0,67.00,37.0,29.5,14.00,2985.0
92,24.80,26.7,28.50,20.0,28.0,2.40,168.0,6200.0,2355.0,19.3,5.0,184.0,105.0,69.00,38.0,30.0,15.00,3245.0

In [72]:
# 42. How to use apply function on existing columns with global variables as additional arguments?
# Difficulty Level: L3

# In df, use apply method to replace the missing values in Min.Price with the column’s mean and
# # those in Max.Price with the column’s median.

# Input
df = pd.read_csv('./cars.csv')
min_price = df['Min.Price'].mean().round(2)
max_price = df['Max.Price'].median().round(2)

df_numeric_cols = ['Min.Price', 'Max.Price']
# print(df.loc[(df['Min.Price'].isna() | df['Max.Price'].isna()), df_numeric_cols])
print(f'Before replace missing: \n{df[df_numeric_cols].isna().sum()}')


def replace_nan(x, min_price, max_price):
    if x.name == 'Min.Price':
        return x.fillna(min_price)
    else:
        return x.fillna(max_price)


print('=========================')
df[df_numeric_cols] = df[df_numeric_cols].apply(
    lambda x: replace_nan(x, min_price, max_price))
print(f'After replace missing: \n{df[df_numeric_cols].isna().sum()}')
# print(df.loc[(df['Min.Price'].isna() | df['Max.Price'].isna()), df_numeric_cols])

# Solution 2
d = {'Min.Price': np.nanmean, 'Max.Price': np.nanmedian}
df[['Min.Price',
    'Max.Price']] = df[['Min.Price',
                        'Max.Price']].apply(lambda x, d: x.fillna(d[x.name]
                                                                  (x)),
                                            args=(d, ))

Before replace missing:
Min.Price    7
Max.Price    5
dtype: int64
=========================
After replace missing:
Min.Price    0
Max.Price    0
dtype: int64

In [2]:
# 43. How to select a specific column from a dataframe as a dataframe instead of a series?
# Difficulty Level: L2

# Get the first column (a) in df as a dataframe (rather than as a Series).

# Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
type(df[['a']])

pandas.core.frame.DataFrame

In [77]:
# 44. How to change the order of columns of a dataframe?
# Difficulty Level: L3

# Actually 3 questions.

# In df, interchange columns 'a' and 'c'.
# Create a generic function to interchange two columns, without hardcoding column names.

# Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

# Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
print(df)

# Solution 1
def replace_cols(cols, c1, c2):
    new_cols = []
    for col in cols:
        if col == c1:
            new_cols.append(c2)
        elif col == c2:
            new_cols.append(c1)
        else:
            new_cols.append(col)
    return new_cols
df = df.reindex(columns=replace_cols(df.columns, 'a', 'c'))
df.reindex(columns=df.columns[::-1])

# Solution 2
def switch_cols(df, c1, c2):
    columns = df.columns.tolist()
    i1, i2 = columns.index(c1), columns.index(c2)
    columns[i2], columns[i1] = columns[i1], columns[i2]
    return df[columns]
df = switch_cols(df, 'a', 'c')
df.sort_index(ascending=False, axis=1, inplace=True)
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [85]:
# 45. How to set the number of rows and columns displayed in the output?
# Difficulty Level: L2

# Change the pamdas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

# Input

df = pd.read_csv('./cars.csv')
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 10)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

In [88]:
# 46. How to format or suppress scientific notations in a pandas dataframe?
# Difficulty Level: L2

# Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.

# Input
np.random.seed(123)
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df[['random']].round(4)
# Desired Output

# #>    random
# #> 0  0.0035
# #> 1  0.0000
# #> 2  0.0747
# #> 3  0.0000

   random
0  0.0269
1  0.0000
2  0.0000
3  0.0026

In [92]:
# 47. How to format all the values in a dataframe as percentages?
# Difficulty Level: L2

# Format the values in column 'random' of df as percentages.
np.random.seed(123)

# Input
df = pd.DataFrame(np.random.random(4), columns=['random'])

df['random'].apply(lambda x: '{:,.2%}'.format(x))

# Desired Output

#>      random
#> 0    68.97%
#> 1    95.72%
#> 2    15.91%
#> 3    2.10%

0    69.65%
1    28.61%
2    22.69%
3    55.13%
Name: random, dtype: object

In [95]:
# 48. How to filter every nth row in a dataframe?
# Difficulty Level: L1

# From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

# Input

df = pd.read_csv('./cars.csv')
df.loc[::20, ['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [121]:
# 49. How to create a primary key index by combining relevant columns?
# Difficulty Level: L2

# In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and 
# create a index as a combination of these three columns and check if the index is a primary key.

# Input
df = pd.read_csv('./cars.csv', usecols=[0,1,2,3,5])
# print(df[df['Manufacturer'].isna()])
df[['Manufacturer', 'Model', 'Type']] = df[['Manufacturer', 'Model', 'Type']].fillna('missing')
# df[df['Manufacturer'].isna()]
df['Combination'] = df.apply(lambda x: f'{x.Manufacturer}_{x.Model}_{x.Type}', axis=1)
df.set_index(keys=['Combination'], inplace=True)
print(df.index.duplicated().sum()) # it is unique primary key
print(df.index.is_unique)
df

0
True

                          Manufacturer    Model     Type  Min.Price  Max.Price
Combination
Acura_Integra_Small              Acura  Integra    Small       12.9       18.8
missing_Legend_Midsize         missing   Legend  Midsize       29.2       38.7
Audi_90_Compact                   Audi       90  Compact       25.9       32.3
Audi_100_Midsize                  Audi      100  Midsize        NaN       44.6
BMW_535i_Midsize                   BMW     535i  Midsize        NaN        NaN
...                                ...      ...      ...        ...        ...
Volkswagen_Eurovan_Van      Volkswagen  Eurovan      Van       16.6       22.7
Volkswagen_Passat_Compact   Volkswagen   Passat  Compact       17.6       22.4
Volkswagen_Corrado_Sporty   Volkswagen  Corrado   Sporty       22.9       23.7
Volvo_240_Compact                Volvo      240  Compact       21.8       23.5
missing_850_Midsize            missing      850  Midsize       24.8       28.5

[93 rows x 5 columns]

In [159]:
# 50. How to get the row number of the nth largest value in a column?
# Difficulty Level: L2

# Find the row position of the 5th largest value of column 'a' in df.

# Input
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
print(df['a'].values)
print(sorted(df['a'].values))
# Solution 1
print(df[df['a'] == df['a'].nlargest(n=5).values[-1]].index.to_list()[0])
# Solution 2
print(df['a'].argsort()[::-1][5])

[ 6 10 14 22 18 24 27 29  8 15]
[6, 8, 10, 14, 15, 18, 22, 24, 27, 29]
4
4

In [178]:
# 51. How to find the position of the nth largest value greater than a given value?
# Difficulty Level: L2

# In ser, find the position of the 2nd largest value greater than the mean.

# Input
np.random.seed(123)
ser = pd.Series(np.random.randint(1, 100, 15))
position = ser[(ser > ser.mean())
               & (ser == ser.nlargest(n=2).values[-1])].index.to_list()[0]
print(f'Position of the 2nd largest value greater than the mean: {position}')

Position of the 2nd largest value greater than the mean: 7

In [31]:
# 52. How to get the last n rows of a dataframe with row sum > 100?
# Difficulty Level: L2

# Get the last two rows of df whose row sum is greater than 100.
np.random.seed(123)
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

# Solution 1
print(df[df.sum(axis=1) > 100].tail(2))

# Solution 2
row_sums = df.apply(np.sum, axis=1)
print(df.iloc[np.where(row_sums > 100)[0][-2:]])

     0   1   2   3
9   25  34  39  26
12  31  32  37  12
     0   1   2   3
9   25  34  39  26
12  31  32  37  12

In [61]:
# 53. How to find and cap outliers from a series or dataframe column?
# Difficulty Level: L2

# Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

# Input

ser = pd.Series(np.logspace(-2, 2, 30))
# Solution 1
ser[:int(ser.size * 0.05)+1] = np.percentile(ser, q=5)
ser[int(ser.size * 0.95):] = np.percentile(ser, q=95)
print(ser)
# Solution 2
# Solution
# def cap_outliers(ser, low_perc, high_perc):
#     low, high = ser.quantile([low_perc, high_perc])
#     print(low_perc, '%ile: ', low, '|', high_perc, '%ile: ', high)
#     ser[ser < low] = low
#     ser[ser > high] = high
#     return(ser)

# capped_ser = cap_outliers(ser, .05, .95)
# capped_ser

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

In [165]:
# 54. How to reshape a dataframe to the largest possible square after removing the negative values?
# Difficulty Level: L3

# Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. 
# The order of the positive numbers in the result should remain the same as the original.

# Input
np.random.seed(123)
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df = df[df > 0]
# print(df)
arr = df.values.flatten()
arr_without_na = arr[~(pd.isna(arr))]
n = int(np.floor(arr_without_na.shape[0] ** .3))
sorted_arr = np.argsort(arr_without_na)[::-1]
np.take(arr_without_na, sorted(sorted_arr)[:n ** 2]).reshape(n, -1)

array([[46., 37., 27.],
       [12., 26.,  5.],
       [16., 48., 29.]])

In [186]:
# 55. How to swap two rows of a dataframe?
# Difficulty Level: L2

# Swap rows 1 and 2 in df.

# Input

df = pd.DataFrame(np.arange(25).reshape(5, -1))
# Solution
rows_lst = df.index.to_list()
rows_lst[0],rows_lst[1] = rows_lst[1],rows_lst[0]
df.iloc[rows_lst,:]

# Solution (If you not use copy it will point to the same address and it will not swap)
# df.iloc[0,:], df.iloc[1,:] = df.iloc[1,:].copy(), df.iloc[0,:].copy() 
# df

    0   1   2   3   4
0   5   6   7   8   9
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [190]:
# 56. How to reverse the rows of a dataframe?
# Difficulty Level: L2

# Reverse all the rows of dataframe df.

# Input

df = pd.DataFrame(np.arange(25).reshape(5, -1))
df[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [198]:
# 57. How to create one-hot encodings of a categorical variable (dummy variables)?
# Difficulty Level: L2

# Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

# Input

df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
pd.concat([pd.get_dummies(df['a']), df.iloc[:, 1:]], axis=1)

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

In [247]:
# 58. Which column contains the highest number of row-wise maximum values?
# Difficulty Level: L2

# Obtain the column name with the highest number of row-wise maximum’s in df.
np.random.seed(123)
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df.idxmax(axis=1).value_counts().index[0]

0